-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: localhost    Database: cyberwall
-- ------------------------------------------------------
-- Server version	8.4.3

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `id_registry`
--

DROP TABLE IF EXISTS `id_registry`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `id_registry` (
  `id` int unsigned NOT NULL,
  `card_id` bigint unsigned NOT NULL,
  `registered_at` datetime(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6),
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Список всех когда-либо использованных id с указанием карты к которой они были привязаны и времени создания';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `id_registry`
--

LOCK TABLES `id_registry` WRITE;
/*!40000 ALTER TABLE `id_registry` DISABLE KEYS */;
INSERT INTO `id_registry` VALUES (123456781,3,'2026-09-26 14:11:00.292027'),(123456782,2,'2026-09-26 14:11:00.292027'),(123456789,7,'2026-09-26 14:11:00.292027'),(126091579,74,'2026-09-27 14:21:38.336122'),(129267011,43,'2026-09-27 14:21:38.093200'),(141538335,40,'2026-09-27 14:21:38.064005'),(144690317,24,'2026-09-27 14:21:37.911067'),(162727527,19,'2026-09-27 14:21:37.873399'),(164553629,42,'2026-09-27 14:21:38.086370'),(171936812,50,'2026-09-27 14:21:38.140638'),(179384614,104,'2026-09-27 14:21:38.572880'),(179984456,65,'2026-09-27 14:21:38.264655'),(189220247,85,'2026-09-27 14:21:38.425850'),(194717976,83,'2026-09-27 14:21:38.412396'),(201328841,21,'2026-09-27 14:21:37.886866'),(206381356,101,'2026-09-27 14:21:38.552282'),(206972870,58,'2026-09-27 14:21:38.210707'),(212263902,98,'2026-09-27 14:21:38.523614'),(227395609,60,'2026-09-27 14:21:38.229644'),(231447179,78,'2026-09-27 14:21:38.371168'),(234952708,35,'2026-09-27 14:21:38.018942'),(243379775,103,'2026-09-27 14:21:38.566295'),(252937398,22,'2026-09-27 14:21:37.894001'),(277143661,93,'2026-09-27 14:21:38.485824'),(287989559,61,'2026-09-27 14:21:38.236733'),(292420845,80,'2026-09-27 14:21:38.389482'),(299424613,53,'2026-09-27 14:21:38.163729'),(301193025,73,'2026-09-27 14:21:38.328382'),(302651711,48,'2026-09-27 14:21:38.126667'),(334308416,33,'2026-09-27 14:21:38.000172'),(336619327,39,'2026-09-27 14:21:38.056781'),(341208812,30,'2026-09-27 14:21:37.977428'),(341633342,90,'2026-09-27 14:21:38.459140'),(354674830,84,'2026-09-27 14:21:38.419069'),(356119534,76,'2026-09-27 14:21:38.355163'),(374655507,32,'2026-09-27 14:21:37.993333'),(375462568,29,'2026-09-27 14:21:37.968189'),(419827328,46,'2026-09-27 14:21:38.113389'),(421166047,17,'2026-09-27 14:21:37.854998'),(428400513,57,'2026-09-27 14:21:38.201097'),(439211109,68,'2026-09-27 14:21:38.289026'),(447575586,34,'2026-09-27 14:21:38.009595'),(471047513,15,'2026-09-27 14:21:37.840027'),(472679681,26,'2026-09-27 14:21:37.925150'),(478701352,28,'2026-09-27 14:21:37.961128'),(479656383,31,'2026-09-27 14:21:37.986383'),(484564462,92,'2026-09-27 14:21:38.477076'),(496177974,67,'2026-09-27 14:21:38.279989'),(497833721,41,'2026-09-27 14:21:38.075039'),(508651805,99,'2026-09-27 14:21:38.534255'),(510471261,112,'2026-09-27 14:21:38.634564'),(517902279,20,'2026-09-27 14:21:37.880490'),(524836328,63,'2026-09-27 14:21:38.250771'),(526878849,75,'2026-09-27 14:21:38.345143'),(532559090,5,'2026-09-27 13:38:22.715193'),(542934279,52,'2026-09-27 14:21:38.156398'),(543327462,55,'2026-09-27 14:21:38.179511'),(547394115,96,'2026-09-27 14:21:38.507541'),(549662838,59,'2026-09-27 14:21:38.220820'),(550898682,64,'2026-09-27 14:21:38.257587'),(555325971,37,'2026-09-27 14:21:38.039432'),(560700497,23,'2026-09-27 14:21:37.902384'),(595765050,106,'2026-09-27 14:21:38.586592'),(595978383,49,'2026-09-27 14:21:38.133416'),(607521652,69,'2026-09-27 14:21:38.296124'),(611676574,56,'2026-09-27 14:21:38.188854'),(632036814,36,'2026-09-27 14:21:38.028072'),(657760995,62,'2026-09-27 14:21:38.243669'),(665245128,18,'2026-09-27 14:21:37.866003'),(668320254,54,'2026-09-27 14:21:38.171838'),(675569978,45,'2026-09-27 14:21:38.106040'),(681892892,91,'2026-09-27 14:21:38.468189'),(682076773,86,'2026-09-27 14:21:38.432251'),(692137716,1,'2026-09-27 13:37:45.759202'),(705074687,108,'2026-09-27 14:21:38.602950'),(719974961,70,'2026-09-27 14:21:38.305163'),(726624525,72,'2026-09-27 14:21:38.321206'),(732024948,94,'2026-09-27 14:21:38.492482'),(741350121,25,'2026-09-27 14:21:37.918055'),(746861711,16,'2026-09-27 14:21:37.847281'),(750889244,97,'2026-09-27 14:21:38.516930'),(757352470,79,'2026-09-27 14:21:38.380330'),(767385476,88,'2026-09-27 14:21:38.445879'),(771748937,51,'2026-09-27 14:21:38.148933'),(772971694,82,'2026-09-27 14:21:38.404458'),(777309876,71,'2026-09-27 14:21:38.312295'),(780519442,38,'2026-09-27 14:21:38.047938'),(789951577,109,'2026-09-27 14:21:38.611530'),(802791960,14,'2026-09-27 14:21:37.831871'),(802814558,111,'2026-09-27 14:21:38.625426'),(812370639,8,'2026-09-26 16:34:22.000452'),(834533852,110,'2026-09-27 14:21:38.618386'),(872426733,47,'2026-09-27 14:21:38.120003'),(878473962,107,'2026-09-27 14:21:38.595758'),(890046840,81,'2026-09-27 14:21:38.396970'),(901794442,4,'2026-09-27 13:38:06.191073'),(906467349,100,'2026-09-27 14:21:38.543507'),(908757948,89,'2026-09-27 14:21:38.452510'),(912504763,102,'2026-09-27 14:21:38.559577'),(928693786,95,'2026-09-27 14:21:38.499313'),(939348074,27,'2026-09-27 14:21:37.951720'),(942723153,87,'2026-09-27 14:21:38.439184'),(943912661,113,'2026-09-27 14:21:38.643799'),(947226263,66,'2026-09-27 14:21:38.272818'),(952674197,44,'2026-09-27 14:21:38.100054'),(966783773,105,'2026-09-27 14:21:38.580026'),(999961150,77,'2026-09-27 14:21:38.362444');
/*!40000 ALTER TABLE `id_registry` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `lock_access`
--

DROP TABLE IF EXISTS `lock_access`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `lock_access` (
  `lock_id` int unsigned NOT NULL,
  `card_id` bigint unsigned NOT NULL,
  PRIMARY KEY (`lock_id`,`card_id`),
  CONSTRAINT `fk_lock_access_lock` FOREIGN KEY (`lock_id`) REFERENCES `locks` (`lock_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Разрешения доступа пользователям по card_id к замкам по lock_id';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lock_access`
--

LOCK TABLES `lock_access` WRITE;
/*!40000 ALTER TABLE `lock_access` DISABLE KEYS */;
INSERT INTO `lock_access` VALUES (131735070,1),(131735070,2),(993343565,2);
/*!40000 ALTER TABLE `lock_access` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `locks`
--

DROP TABLE IF EXISTS `locks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `locks` (
  `lock_id` int unsigned NOT NULL DEFAULT (floor((100000000 + (rand() * 900000000)))),
  `description` varchar(255) DEFAULT NULL,
  `open_cmd` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`lock_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Список замков и команды их достанционного открытия';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `locks`
--

LOCK TABLES `locks` WRITE;
/*!40000 ALTER TABLE `locks` DISABLE KEYS */;
INSERT INTO `locks` VALUES (131735070,'Тестовый 1',0),(993343565,'Тестовый 2',0);
/*!40000 ALTER TABLE `locks` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `logs`
--

DROP TABLE IF EXISTS `logs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `logs` (
  `log_id` int unsigned NOT NULL AUTO_INCREMENT,
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `object_id` int unsigned DEFAULT NULL,
  `subject_id` int unsigned DEFAULT NULL,
  `log_action` varchar(255) NOT NULL,
  `value` bigint DEFAULT NULL,
  PRIMARY KEY (`log_id`)
) ENGINE=InnoDB AUTO_INCREMENT=1039 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Все важные операции с финансами и нетраном';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `logs`
--

LOCK TABLES `logs` WRITE;
/*!40000 ALTER TABLE `logs` DISABLE KEYS */;
INSERT INTO `logs` VALUES (880,'2026-08-22 21:12:06',123456781,123456782,'SEND MONEY',111),(881,'2026-08-22 21:12:06',123456782,123456781,'RECEIVE MONEY',111),(882,'2026-08-22 21:25:26',123456782,123456781,'SEND MONEY',888),(883,'2026-08-22 21:25:26',123456781,123456782,'RECEIVE MONEY',888),(884,'2026-08-22 21:53:07',123456781,123456782,'SEND MONEY',100),(885,'2026-08-22 21:53:07',123456782,123456781,'RECEIVE MONEY',100),(886,'2026-08-22 21:56:57',123456782,123456781,'SEND MONEY',100),(887,'2026-08-22 21:56:57',123456781,123456782,'RECEIVE MONEY',100),(888,'2026-08-22 21:57:19',123456781,123456782,'SEND MONEY',10),(889,'2026-08-22 21:57:19',123456782,123456781,'RECEIVE MONEY',10),(890,'2026-08-22 21:57:40',123456781,123456782,'SEND MONEY',100),(891,'2026-08-22 21:57:40',123456782,123456781,'RECEIVE MONEY',100),(892,'2026-08-22 22:03:08',123456782,123456781,'SEND MONEY',500),(893,'2026-08-22 22:03:08',123456781,123456782,'RECEIVE MONEY',500),(894,'2026-08-22 22:04:28',123456782,123456781,'SEND MONEY',555),(895,'2026-08-22 22:04:28',123456781,123456782,'RECEIVE MONEY',555),(896,'2026-08-23 10:33:53',123456782,123456782,'SEND MONEY',900),(897,'2026-08-23 10:33:53',123456782,123456782,'RECEIVE MONEY',900),(898,'2026-08-23 12:05:32',123456782,123456781,'SEND MONEY',85),(899,'2026-08-23 12:05:32',123456781,123456782,'RECEIVE MONEY',85),(900,'2026-08-23 13:53:44',123456782,123456781,'SEND MONEY',666),(901,'2026-08-23 13:53:44',123456781,123456782,'RECEIVE MONEY',666),(902,'2026-08-23 14:44:30',123456781,123456782,'SEND MONEY',42),(903,'2026-08-23 14:44:30',123456782,123456781,'RECEIVE MONEY',42),(904,'2026-08-23 19:42:41',123456782,123456781,'SEND MONEY',456),(905,'2026-08-23 19:42:41',123456781,123456782,'RECEIVE MONEY',456),(906,'2026-08-23 23:55:39',123456781,123456782,'SEND MONEY',147),(907,'2026-08-23 23:55:39',123456782,123456781,'RECEIVE MONEY',147),(908,'2026-08-24 08:27:39',123456782,123456781,'SEND MONEY',119),(909,'2026-08-24 08:27:39',123456781,123456782,'RECEIVE MONEY',119),(910,'2026-08-24 23:12:02',123456781,123456782,'SEND MONEY',896),(911,'2026-08-24 23:12:02',123456782,123456781,'RECEIVE MONEY',896),(912,'2026-08-24 23:12:23',123456782,123456781,'SEND MONEY',56),(913,'2026-08-24 23:12:23',123456781,123456782,'RECEIVE MONEY',56),(914,'2026-08-25 01:27:11',123456782,123456781,'SEND MONEY',853),(915,'2026-08-25 01:27:11',123456781,123456782,'RECEIVE MONEY',853),(916,'2026-08-25 01:29:23',123456782,123456781,'SEND MONEY',12),(917,'2026-08-25 01:29:23',123456781,123456782,'RECEIVE MONEY',12),(918,'2026-08-25 01:50:40',123456782,123456781,'SEND MONEY',89),(919,'2026-08-25 01:50:40',123456781,123456782,'RECEIVE MONEY',89),(920,'2026-08-25 01:50:51',123456782,123456781,'SEND MONEY',87),(921,'2026-08-25 01:50:51',123456781,123456782,'RECEIVE MONEY',87),(922,'2026-08-25 01:51:02',123456781,123456782,'SEND MONEY',5558),(923,'2026-08-25 01:51:02',123456782,123456781,'RECEIVE MONEY',5558),(924,'2026-08-25 09:54:43',123456782,123456781,'SEND MONEY',74),(925,'2026-08-25 09:54:43',123456781,123456782,'RECEIVE MONEY',74),(926,'2026-08-25 09:58:41',123456782,123456781,'SEND MONEY',1),(927,'2026-08-25 09:58:41',123456781,123456782,'RECEIVE MONEY',1),(928,'2026-08-25 13:40:59',123456782,123456781,'SEND MONEY',951),(929,'2026-08-25 13:40:59',123456781,123456782,'RECEIVE MONEY',951),(930,'2026-08-25 14:48:57',123456781,123456782,'SEND MONEY',89),(931,'2026-08-25 14:48:57',123456782,123456781,'RECEIVE MONEY',89),(932,'2026-08-25 14:49:10',123456782,123456781,'SEND MONEY',57),(933,'2026-08-25 14:49:10',123456781,123456782,'RECEIVE MONEY',57),(934,'2026-08-25 15:27:20',123456782,123456781,'SEND MONEY',52),(935,'2026-08-25 15:27:20',123456781,123456782,'RECEIVE MONEY',52),(936,'2026-08-25 15:27:36',123456781,123456782,'SEND MONEY',53),(937,'2026-08-25 15:27:36',123456782,123456781,'RECEIVE MONEY',53),(938,'2026-08-26 00:52:38',123456781,123456782,'SEND MONEY',14),(939,'2026-08-26 00:52:38',123456782,123456781,'RECEIVE MONEY',14),(940,'2026-08-26 09:13:47',123456782,123456781,'SEND MONEY',18),(941,'2026-08-26 09:13:47',123456781,123456782,'RECEIVE MONEY',18),(942,'2026-08-26 15:03:01',123456782,123456781,'SEND MONEY',47),(943,'2026-08-26 15:03:01',123456781,123456782,'RECEIVE MONEY',47),(944,'2026-08-26 16:06:15',123456782,123456781,'SEND MONEY',1),(945,'2026-08-26 16:06:15',123456781,123456782,'RECEIVE MONEY',1),(946,'2026-08-27 10:36:44',123456781,100000001,'SEND MONEY',555),(947,'2026-08-27 10:36:44',100000001,123456781,'RECEIVE MONEY',555),(948,'2026-08-27 18:37:32',123456781,100000001,'SEND MONEY',999000),(949,'2026-08-27 18:37:32',100000001,123456781,'RECEIVE MONEY',999000),(950,'2026-08-28 06:56:57',100000001,100000001,'SEND MONEY',50),(951,'2026-08-28 06:56:57',100000001,100000001,'RECEIVE MONEY',50),(952,'2026-08-29 00:17:28',100000001,123456783,'SEND MONEY',999000),(953,'2026-08-29 00:17:28',123456783,100000001,'RECEIVE MONEY',999000),(954,'2026-08-29 00:23:00',123,321,'NETRUN_SEND MONEY',999000),(955,'2026-08-29 00:23:00',321,123,'NETRUN_RECEIVE MONEY',999000),(956,'2026-08-29 01:14:57',321,123456782,'SEND MONEY',700000),(957,'2026-08-29 01:14:57',123456782,321,'RECEIVE MONEY',700000),(958,'2026-08-29 02:57:08',123456781,321,'SEND MONEY',100000),(959,'2026-08-29 02:57:08',321,123456781,'RECEIVE MONEY',100000),(960,'2026-08-29 02:58:52',666,321,'NETRUN_SUCCESS HACK PENTAGON',5),(961,'2026-08-29 03:00:47',8888,321,'NETRUN_SUCCESS HACK PENTAGON',5),(962,'2026-08-29 03:02:07',8888,1,'NETRUN_FAIL HACK PENTAGON',0),(963,'2026-08-31 02:07:55',123456781,123456782,'SEND LOSA',5),(964,'2026-08-31 02:07:55',123456782,123456781,'RECEIVE LOSA',5),(965,'2026-08-31 02:18:12',321,123456782,'SEND MONEY',500),(966,'2026-08-31 02:18:12',123456782,321,'RECEIVE MONEY',500),(967,'2026-08-31 02:21:01',321,123456781,'SEND MONEY',399000),(968,'2026-08-31 02:21:01',123456781,321,'RECEIVE MONEY',399000),(969,'2026-08-31 02:24:14',321,123456781,'SEND MONEY',0),(970,'2026-08-31 02:24:14',123456781,321,'RECEIVE MONEY',0),(971,'2026-08-31 02:24:26',321,123456781,'SEND MONEY',0),(972,'2026-08-31 02:24:26',123456781,321,'RECEIVE MONEY',0),(973,'2026-08-31 02:27:21',123456781,321,'SEND MONEY',500000),(974,'2026-08-31 02:27:21',321,123456781,'RECEIVE MONEY',500000),(975,'2026-08-31 02:27:39',123456781,321,'SEND MONEY',800000),(976,'2026-08-31 02:27:39',321,123456781,'RECEIVE MONEY',800000),(977,'2026-08-31 02:27:57',123456781,123456782,'SEND MONEY',400),(978,'2026-08-31 02:27:57',123456782,123456781,'RECEIVE MONEY',400),(979,'2026-08-31 18:37:02',123456781,123456782,'SEND MONEY',700),(980,'2026-08-31 18:37:02',123456782,123456781,'RECEIVE MONEY',700),(981,'2026-08-31 20:27:45',321,123456782,'SEND MONEY',500),(982,'2026-08-31 20:27:45',123456782,321,'RECEIVE MONEY',500),(983,'2026-09-01 10:59:14',321,123456782,'SEND MONEY',100),(984,'2026-09-01 10:59:14',123456782,321,'RECEIVE MONEY',100),(985,'2026-09-01 10:59:52',123456781,123456782,'SEND MONEY',100),(986,'2026-09-01 10:59:52',123456782,123456781,'RECEIVE MONEY',100),(987,'2026-09-01 16:42:31',123456781,123456782,'SEND MONEY',200),(988,'2026-09-01 16:42:31',123456782,123456781,'RECEIVE MONEY',200),(989,'2026-09-01 16:44:08',123456781,123456782,'SEND MONEY',800),(990,'2026-09-01 16:44:08',123456782,123456781,'RECEIVE MONEY',800),(991,'2026-09-01 16:45:18',123456781,123456782,'SEND MONEY',1000000),(992,'2026-09-01 16:45:18',123456782,123456781,'RECEIVE MONEY',1000000),(993,'2026-09-01 16:45:50',123456781,123456782,'SEND MONEY',1000000000),(994,'2026-09-01 16:45:50',123456782,123456781,'RECEIVE MONEY',1000000000),(995,'2026-09-01 16:46:26',123456781,123456782,'SEND MONEY',1000000000),(996,'2026-09-01 16:46:26',123456782,123456781,'RECEIVE MONEY',1000000000),(997,'2026-09-01 17:48:07',321,123456782,'SEND MONEY',78900),(998,'2026-09-01 17:48:07',123456782,321,'RECEIVE MONEY',78900),(999,'2026-09-01 21:04:06',123456781,123456782,'SEND MONEY',100),(1000,'2026-09-01 21:04:06',123456782,123456781,'RECEIVE MONEY',100),(1001,'2026-09-12 13:19:43',321,123456782,'SEND MONEY',777777800),(1002,'2026-09-12 13:19:43',123456782,321,'RECEIVE MONEY',777777800),(1003,'2026-09-12 15:09:08',123456782,321,'SEND MONEY',100),(1004,'2026-09-12 15:09:08',321,123456782,'RECEIVE MONEY',100),(1005,'2026-09-12 15:13:24',321,123456782,'SEND MONEY',100),(1006,'2026-09-12 15:13:24',123456782,321,'RECEIVE MONEY',100),(1007,'2026-09-12 15:21:51',321,123456782,'SEND MONEY',100),(1008,'2026-09-12 15:21:51',123456782,321,'RECEIVE MONEY',100),(1009,'2026-09-12 15:37:33',321,123456782,'SEND MONEY',888888900),(1010,'2026-09-12 15:37:33',123456782,321,'RECEIVE MONEY',888888900),(1011,'2026-09-12 15:40:22',123456782,321,'SEND MONEY',900),(1012,'2026-09-12 15:40:22',321,123456782,'RECEIVE MONEY',900),(1013,'2026-09-12 15:41:27',321,123456782,'SEND MONEY',100),(1014,'2026-09-12 15:41:27',123456782,321,'RECEIVE MONEY',100),(1015,'2026-09-12 15:43:14',123456782,321,'SEND MONEY',900),(1016,'2026-09-12 15:43:14',321,123456782,'RECEIVE MONEY',900),(1017,'2026-09-12 15:46:18',321,123456782,'SEND MONEY',600),(1018,'2026-09-12 15:46:18',123456782,321,'RECEIVE MONEY',600),(1019,'2026-09-12 15:55:55',321,123456782,'SEND MONEY',55600),(1020,'2026-09-12 15:55:55',123456782,321,'RECEIVE MONEY',55600),(1021,'2026-09-12 15:57:40',123456782,321,'SEND MONEY',1000),(1022,'2026-09-12 15:57:40',321,123456782,'RECEIVE MONEY',1000),(1023,'2026-09-12 16:04:22',123456782,321,'SEND MONEY',888888900),(1024,'2026-09-12 16:04:22',321,123456782,'RECEIVE MONEY',888888900),(1025,'2026-09-12 17:13:18',123456782,321,'SEND MONEY',900),(1026,'2026-09-12 17:13:18',321,123456782,'RECEIVE MONEY',900),(1027,'2026-09-13 14:35:53',123,123456781,'SEND MONEY',100),(1028,'2026-09-13 14:35:53',123456781,123,'RECEIVE MONEY',100),(1029,'2026-09-13 14:39:04',123456782,123,'SEND LOSA',1),(1030,'2026-09-13 14:39:04',123,123456782,'RECEIVE LOSA',1),(1031,'2026-09-13 17:21:13',123456782,123,'SEND MONEY',12500),(1032,'2026-09-13 17:21:13',123,123456782,'RECEIVE MONEY',12500),(1033,'2026-09-13 17:21:34',123456782,123,'SEND MONEY',1300),(1034,'2026-09-13 17:21:34',123,123456782,'RECEIVE MONEY',1300),(1035,'2026-09-13 17:22:58',321,123456782,'SEND MONEY',3600),(1036,'2026-09-13 17:22:58',123456782,321,'RECEIVE MONEY',3600),(1037,'2026-09-13 17:23:17',321,321,'SEND MONEY',12300),(1038,'2026-09-13 17:23:17',321,321,'RECEIVE MONEY',12300);
/*!40000 ALTER TABLE `logs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `main`
--

DROP TABLE IF EXISTS `main`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `main` (
  `card_id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `id` int unsigned NOT NULL DEFAULT '0',
  `name` varchar(255) NOT NULL,
  `netrunner_lvl` tinyint unsigned NOT NULL DEFAULT '0',
  `password` varchar(255) DEFAULT NULL,
  `losa` int NOT NULL DEFAULT '0',
  `money` int NOT NULL DEFAULT '0',
  `police` tinyint(1) DEFAULT NULL,
  `occupancy` varchar(255) NOT NULL,
  `joinrpg_id` int unsigned DEFAULT NULL,
  PRIMARY KEY (`card_id`),
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `uq_main_joinrpg_id` (`joinrpg_id`)
) ENGINE=InnoDB AUTO_INCREMENT=114 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `main`
--

LOCK TABLES `main` WRITE;
/*!40000 ALTER TABLE `main` DISABLE KEYS */;
INSERT INTO `main` VALUES (1,692137716,'Корпорация \"Верк\"',5,NULL,205,1369649547,NULL,'Werg',NULL),(2,123456782,'Шляпа',1,'01012000',358,632118953,1,'Vostok',NULL),(3,123456781,'Ересь',2,'01021990',7,100,NULL,'Zapad',NULL),(4,901794442,'Марьяна',0,'20071996',1,33700,NULL,'Zapad',NULL),(5,532559090,'Кристиан Шварц Фон Хряк',0,NULL,0,2147483647,NULL,'Zapad',NULL),(7,123456789,'Райнис',3,'16081994',0,10000,NULL,'Bar',NULL),(8,812370639,'Тест Создания id',0,NULL,0,0,NULL,'test',NULL),(14,802791960,'Сабрина Хессе',0,'18011999',0,0,NULL,'',125348),(15,471047513,'Герхард Гросс',0,'11011998',0,0,NULL,'',125354),(16,746861711,'Тереза Венцль',0,'18102006',0,0,NULL,'',125355),(17,421166047,'Феликс Зингер',0,'12011989',0,0,NULL,'',125356),(18,665245128,'Юли Леммке',0,'07121988',0,0,NULL,'',125357),(19,162727527,'Петер Кляйн',0,'20122002',0,0,NULL,'',125358),(20,517902279,'Отто',0,'19051991',0,0,NULL,'',125359),(21,201328841,'Фрида',0,'09121998',0,0,NULL,'',125361),(22,252937398,'Юрген Бергер',0,'31031990',0,0,NULL,'',125362),(23,560700497,'Паук',0,'18071994',0,0,NULL,'',125363),(24,144690317,'Вальдемар Лёв',0,'20101988',0,0,NULL,'',125365),(25,741350121,'Люди',0,'05121991',0,0,NULL,'',125368),(26,472679681,'Анамария Фрезе',0,'26091996',0,0,NULL,'',125369),(27,939348074,'Танте',0,'18121998',0,0,NULL,'',125370),(28,478701352,'Финк',0,'08041984',0,0,NULL,'',125372),(29,375462568,'Рокки',0,'23022004',0,0,NULL,'',125373),(30,341208812,'Ctrl',0,'02101996',0,0,NULL,'',125374),(31,479656383,'Магдалина Кельнер',0,'24071990',0,0,NULL,'',125375),(32,374655507,'Мясник',0,'29051997',0,0,NULL,'',125376),(33,334308416,'Уве Зауэр',0,'18012001',0,0,NULL,'',125380),(34,447575586,'Урсула Хеклер',0,'20101992',0,0,NULL,'',125381),(35,234952708,'Неон',0,'29061996',0,0,NULL,'',125382),(36,632036814,'Ашер Айс',0,'21071997',0,0,NULL,'',125385),(37,555325971,'Флора Шван',0,'14072000',0,0,NULL,'',125387),(38,780519442,'Вильфахер',0,'07031994',0,0,NULL,'',125388),(39,336619327,'Ванда Лауф',0,'12071991',0,0,NULL,'',125389),(40,141538335,'Моника Бауш',0,'08021999',0,0,NULL,'',125390),(41,497833721,'Эвелина Ланнер',0,'15101995',0,0,NULL,'',125391),(42,164553629,'Улоф Лист',0,'02111989',0,0,NULL,'',125392),(43,129267011,'Ганс Шнайдер',0,'17051984',0,0,NULL,'',125393),(44,952674197,'Эльза Малер',0,'05111991',0,0,NULL,'',125394),(45,675569978,'Августа Анмут',0,'23101994',0,0,NULL,'',125395),(46,419827328,'Витольд А.',0,'19041984',0,0,NULL,'',125396),(47,872426733,'Хильда Ш.',0,'04041989',0,0,NULL,'',125397),(48,302651711,'Кристоф З.',0,'21041984',0,0,NULL,'',125398),(49,595978383,'Алисия Г.',0,'31032002',0,0,NULL,'',125399),(50,171936812,'Йозеф К.',0,'08092000',0,0,NULL,'',125400),(51,771748937,'Марк Рифф',0,'21011990',0,0,NULL,'',125401),(52,542934279,'Фауст',0,'29081998',0,0,NULL,'',125402),(53,299424613,'Рильке',0,'14071999',0,0,NULL,'',125403),(54,668320254,'Фрау Шталь',0,'15051980',0,0,NULL,'',125404),(55,543327462,'C-4',0,'24021987',0,0,NULL,'',125405),(56,611676574,'Уборщик',0,'07041995',0,0,NULL,'',125406),(57,428400513,'Вольф',0,'28081977',0,0,NULL,'',125407),(58,206972870,'Стерлядь',0,'07081980',0,0,NULL,'',125408),(59,549662838,'Ядвига Новак',0,'02041984',0,0,NULL,'',125443),(60,227395609,'Янош Новак',0,'23051994',0,0,NULL,'',125444),(61,287989559,'Инго Вельт',0,'23011998',0,0,NULL,'',125445),(62,657760995,'Сюзанна Тодд',0,'28101990',0,0,NULL,'',125446),(63,524836328,'Рассел Кребс',0,'08091984',0,0,NULL,'',125447),(64,550898682,'Клаудия Нойнер',0,'13031987',0,0,NULL,'',125448),(65,179984456,'Крупье',0,'26111987',0,0,NULL,'',125449),(66,947226263,'Электра',0,'10061996',0,0,NULL,'',125450),(67,496177974,'Аттила',0,'03031997',0,0,NULL,'',125451),(68,439211109,'Грета Нойнер',0,'18111986',0,0,NULL,'',125452),(69,607521652,'Кай Эрзац',0,'18051988',0,0,NULL,'',125453),(70,719974961,'Сангха',0,'25011992',0,0,NULL,'',125454),(71,777309876,'Архат',0,'12122002',0,0,NULL,'',125455),(72,726624525,'Роза фон Праунхайм',0,'24011995',0,0,NULL,'',125456),(73,301193025,'Армин',0,'22102006',0,0,NULL,'',125458),(74,126091579,'Талула',0,'23021993',0,0,NULL,'',125459),(75,526878849,'Несси Телеки',0,'19091987',0,0,NULL,'',125460),(76,356119534,'Маттиас Керц',0,'16091991',0,0,NULL,'',125461),(77,999961150,'Мурад Сийах',0,'27091980',0,0,NULL,'',125462),(78,231447179,'Фатима Сийах',0,'08072000',0,0,NULL,'',125463),(79,757352470,'Осси',0,'06061997',0,0,NULL,'',125465),(80,292420845,'F',0,'23101982',0,0,NULL,'',125466),(81,890046840,'Меха',0,'07082011',0,0,NULL,'',125467),(82,772971694,'Гроза',0,'08041997',0,0,NULL,'',125468),(83,194717976,'Игла',0,'14061983',0,0,NULL,'',125469),(84,354674830,'Щепка',0,'23062007',0,0,NULL,'',125470),(85,189220247,'Киборг',0,'05081992',0,0,NULL,'',125471),(86,682076773,'Кактус',0,'12101998',0,0,NULL,'',125472),(87,942723153,'Талтош',0,'05041998',0,0,NULL,'',125473),(88,767385476,'Капитан',0,'22081983',0,0,NULL,'',125474),(89,908757948,'Шкет',0,'26071975',0,0,NULL,'',125475),(90,341633342,'Сорока',0,'12071982',0,0,NULL,'',125476),(91,681892892,'Аль',0,'18011982',0,0,NULL,'',125477),(92,484564462,'Константин Эйд',0,'17121987',0,0,NULL,'',125478),(93,277143661,'Эрст Эйд',0,'20111993',0,0,NULL,'',125480),(94,732024948,'Тобиас',0,'01031982',0,0,NULL,'',125481),(95,928693786,'Ниман',0,'07081986',0,0,NULL,'',125482),(96,547394115,'Морна',0,'15071988',0,0,NULL,'',125483),(97,750889244,'Вертер',0,'28101992',0,0,NULL,'',125484),(98,212263902,'Ворон',0,'27101990',0,0,NULL,'',125485),(99,508651805,'Вигил',0,'18061999',0,0,NULL,'',125486),(100,906467349,'Клара',0,'22121996',0,0,NULL,'',125487),(101,206381356,'Мави',0,'03031994',0,0,NULL,'',125488),(102,912504763,'Бенно',0,'20031997',0,0,NULL,'',125489),(103,243379775,'Кобра',0,'25041990',0,0,NULL,'',125490),(104,179384614,'Вальтер Фиц',0,'09111999',0,0,NULL,'',125863),(105,966783773,'Оса',0,'12021996',0,0,NULL,'',125865),(106,595765050,'БМВ',0,'10081991',0,0,NULL,'',125878),(107,878473962,'Ангела Тотлебен',0,'21111984',0,0,NULL,'',125879),(108,705074687,'Ида Гренце',0,'21021983',0,0,NULL,'',125880),(109,789951577,'Прокси',0,'28091998',0,0,NULL,'',125881),(110,834533852,'Сибилла Эренрейх',0,'16121986',0,0,NULL,'',125882),(111,802814558,'Конг',0,'24071995',0,0,NULL,'',125889),(112,510471261,'Шифт',0,'16011991',0,0,NULL,'',125890),(113,943912661,'Ева Л.',0,'31072001',0,0,NULL,'',125891);
/*!40000 ALTER TABLE `main` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `mainBeforeInsert` BEFORE INSERT ON `main` FOR EACH ROW -- Для каждой добавляемой INSERT строки
BEGIN

	-- Этот код выполняется каждый раз когда происходит добавление новой записи в таблицу main
	-- Он генерирует новый уникальный id пользователя которого еще никогда не было в БД и добавляет его в список уже использованных
	-- Генерация происходит даже если id попытались указать при вставке - все равно будет задан сгенерированный вместо указанного

    DECLARE _newId INT UNSIGNED;
    -- Сгенерировать id и добавить его в реестр
    CALL generateId(NEW.card_id, _newId);
    -- Присвоить id создаваемой записи
    SET NEW.id = _newId;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `mainAfterInsert` AFTER INSERT ON `main` FOR EACH ROW -- Для каждой добавленной INSERT строки
	-- Этот код выполняется каждый раз после того как происходит добавление новой записи в таблицу main
	-- Он еще раз задает card_id в таблице id_registry на случай если beforeInsert получил card_id = 0 
	-- когда при создании записи card_id не был указан и назначился авто инкрементом
    UPDATE cyberwall.id_registry
    SET card_id = NEW.card_id
    WHERE id = NEW.id */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Dumping routines for database 'cyberwall'
--
/*!50003 DROP PROCEDURE IF EXISTS `changeId` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `changeId`(
    IN cardId   BIGINT UNSIGNED,            -- card_id пользователя, которому необходимо сменить id
    OUT newId   INT UNSIGNED,				-- Новый назначенный ему id
    OUT errCode	INT                         -- Код ошибки, 0 успешно, таблица ниже
)
BEGIN

    -- Смена ID существующей записи по ее card_id
    -- Это самостоятельная транзакция. Вызывать на соединении без незавершенной
    -- транзакции: START TRANSACTION в MySQL не поддерживает вложенность
	-- Возможна проблема: при обрыве связи в момент выполнения клиент может не получить новый id, но id при этом будет изменен!

	/* 
	ERR CODE:
	При любом ERR CODE кроме 0 изменение ID не было произведено!
	
	0 	- NO_ERROR							(нет ошибок, успешное выполнение)
	1 	- SENDER_NOT_FOUND 					(пользователь не найден в БД, для перевода - отправитель не найден в БД)
	*/

	-- Объявления +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

    DECLARE _oldId INT UNSIGNED;            -- Старый id
    DECLARE _newId INT UNSIGNED;            -- Новый id
    DECLARE _found BOOLEAN DEFAULT TRUE;	-- Признак "пользователь найден в БД"

    -- Любая SQL-ошибка = откат транзакции и вернуть ошибку тому кто вызвал процедуру
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;							-- Откатить все изменения если они были сделаны
        SET newId = NULL;
        RESIGNAL;							-- Отправить код ошибки SQL вызывающему процедуру
    END;

	-- Код +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	SET errCode = 0;

    START TRANSACTION;

	-- Проверить наличие пользователя с таким card_id, попытавшись получить его старый id и заблокировать строку от изменений
    BEGIN
		-- Обработка ошибки "пользователя с таким card_id нет в БД"
        DECLARE CONTINUE HANDLER FOR NOT FOUND SET _found = FALSE;

        SELECT main.id INTO _oldId
        FROM main
        WHERE main.card_id = cardId
        FOR UPDATE;
    END;

    IF _found THEN

		-- Пользователь найден
		CALL `generateId`(cardId, _newId);	-- Сгенерировать новый уникальный id который никогда ранее не использовался
		
		-- Изменить id в main
		UPDATE `main`
		SET `id` = _newId
		WHERE `card_id` = cardId;

		COMMIT;
    	SET newId = _newId;

	ELSE

		-- Пользователь не наден
		ROLLBACK;
    	SET newId = NULL;
		SET errCode = 1;

    END IF;

END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `checkLockAccess` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `checkLockAccess`(
    IN 	lock_id 		INT UNSIGNED,			-- id замка
	IN 	card_id			BIGINT UNSIGNED,		-- id карты пользователя
	OUT accessGranted	BOOL,					-- TRUE если пользователь имеет права доступа к замку
	OUT errCode			INT						-- Код ошибки, 0 успешно, таблица ниже
)
BEGIN

    /*
    Проверяет наличие прав доступа к замку
    */

	/* 
	ERR CODE:
	При любом ERR CODE кроме 0 accessGranted = FALSE

	0 	- NO_ERROR				(нет ошибок, успешное выполнение)
	1 	- USER_NOT_FOUND 		(пользователя с таким card_id не найдено в базе)
	2	- LOCK_NOT_FOUND		(замка с таким lock_id не найдено в базе)
	*/

	-- Код +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	-- Начальные значения
	SET accessGranted = FALSE;
	SET errCode = 0;

	-- Проверка существования пользователя
	IF NOT EXISTS (
		SELECT 1
		FROM main
		WHERE main.card_id = card_id
	) THEN
		-- Пользователь не найден
		SET errCode = 1;

	-- Проверка существования замка
	ELSEIF NOT EXISTS (
		SELECT 1
		FROM locks
		WHERE locks.lock_id = lock_id
	) THEN
		-- Замок не найден
		SET errCode = 2;

	-- Проверка прав доступа
	ELSE
		SET accessGranted = EXISTS (
			SELECT 1
			FROM lock_access
			WHERE lock_access.lock_id = lock_id
				AND lock_access.card_id = card_id
		);
	END IF;

END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `generateId` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `generateId`(
    IN cardId BIGINT UNSIGNED,  -- card_id для указания в реестре использованных id
    OUT newId INT UNSIGNED      -- Уникальный id который не использовался раньше, для назначения пользователю
)
procedure_block: BEGIN

	-- Внутренняя процедура создания нового id
	-- КЛИЕНТЫ НЕ ДОЛЖНЫ ВЫЗЫВАТЬ ЭТУ ПРОЦЕДУРУ!
	-- Вызываетcя ВНУТРИ транзакции создающей/меняющей запись процедуры/программы
	-- Сама не делает START TRANSACTION, COMMIT или ROLLBACK
	-- Не передавать полученный id пользователю до успешного COMMIT!
	-- При любой ошибке вызывающий код должен откатить всю транзакцию

    DECLARE _candidate INT UNSIGNED;            -- Сгенерированный случайно id
    DECLARE _attempt INT UNSIGNED DEFAULT 0;    -- Текущий номер попытки сгенерировать id, который не использовался ранее
    DECLARE _duplicate BOOLEAN DEFAULT FALSE;   -- Признак того что сгенерированный id уже использовался

    SET newId = NULL;

	-- Обработка ошибки "cardId не указан"
    IF cardId IS NULL THEN
        SIGNAL SQLSTATE '45000'
            SET MESSAGE_TEXT = 'CARD_ID_IS_NULL';
    END IF;

	-- Генерация id - не более 200 раз попытаться сгенерировать случайный id до тех пор пока он не будет уникальным
	-- Шанс что уникальный id не будет сгенерирован за 200 попыток близок к нулю, но теоретически возможен
    WHILE _attempt < 200 DO
        SET _attempt = _attempt + 1;
        SET _candidate = FLOOR(100000000 + RAND() * 900000000);
        SET _duplicate = FALSE;

		-- Попытка добавить сгенерированный id в реестр использованных id
        BEGIN
            -- Обработка ошибки "такой id уже есть в реестре использованных"
            DECLARE CONTINUE HANDLER FOR 1062 SET _duplicate = TRUE;

            INSERT INTO `id_registry` (`id`, `card_id`)
            VALUES (_candidate, cardId);
        END;

		-- id не был в реестре использованных и успешно добавлен
        IF NOT _duplicate THEN
            SET newId = _candidate;
            LEAVE procedure_block;		-- Выйти из процедуры
        END IF;
    END WHILE;

    -- За 200 попыток так и не удалось сгенерировать уникальный id - вернуть ошибку (шанс этого исключения близко к нулю, но оно теоретически возможно)
    SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'ID_GENERATION_RETRY_LIMIT_TRY_AGAIN';
END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `logNetrunAction` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `logNetrunAction`(
    IN 	action 			VARCHAR(50),			-- Логгируемое действие нетраннера, до 50 символов
	IN 	objectId		INT UNSIGNED,			-- id объекта подвергшегося взлому (id персонажа, замка, камеры и т.д.)
    IN 	netrunnerId 	INT UNSIGNED,			-- id нетраннера (не card_id!)
    IN 	isSuccess 		BOOL,					-- TRUE если взлом успешен
	OUT errCode			INT						-- Код ошибки, 0 успешно, таблица ниже
)
BEGIN

    /*
    Добавляет в логи запись NETRUN_SUCCESS action или NETRUN_FAIL action
	Заполняет:
	object_id = objectId
	subject_id = netrunnerId (не card_id!)
	value = уровень нетраннера НА МОМЕНТ ДЕЙСТВИЯ (это важно! апгрейд или даунгрейд деки не делает твои старые следы более или менее видимыми!)
	action НЕ БОЛЕЕ 50 СИМВОЛОВ, ИНАЧЕ РАСШИРИТЬ его и _string
    */

	/* 
	ERR CODE:
	При любом ERR CODE кроме 0 запись в логи не выполнена!

	0 	- NO_ERROR				(нет ошибок, успешное выполнение)
	1 	- NOT_FOUND 			(нетраннера с таким id не найдено в базе)
	255 - OTHER					(другая ошибка)
	*/

	-- Объявления +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	DECLARE _string VARCHAR(70);						-- Строка для запись в логи
	DECLARE _netrunnerLvl TINYINT UNSIGNED DEFAULT 0;	-- Уровень нетраннера на момент совершения действия
	DECLARE _notFound BOOL DEFAULT FALSE;				-- Флаг "нетраннер не найден"

	-- Если SELECT ... INTO не нашел строку (нетраннер не найден в БД)
	DECLARE CONTINUE HANDLER FOR NOT FOUND
	BEGIN
	    SET _notFound = TRUE;
	END;

	-- Любая SQL-ошибка = откат транзакции и вернуть ошибку тому кто вызвал процедуру
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;										-- Откатить все изменения если они были сделаны
        RESIGNAL;										-- Отправить код ошибки SQL вызывающему процедуру
    END;

	-- Код +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	SET errCode = 0;

	START TRANSACTION;			-- Блокируется изменения пользователя между получением уровня нетраннера по ID и записью его в логи

	-- Получить уровень нетраннера по netrunnerId и заблокировать изменения пользователя пока не записаны логи
	SET _notFound = false;		-- Инициализация флага "не найден"
	SELECT netrunner_lvl
	INTO _netrunnerLvl
	FROM main
	WHERE id = netrunnerId
	FOR UPDATE;

	-- Убедится что нетраннер существует (HANDLER for not found срабатывал)
    IF _notFound THEN
    	-- При попытке чтения уровня нетраннера записи с таким id не найдено в базе
        SET errCode = 1;		-- NOT_FOUND
    END IF;

	-- Добавить запись в логи
	IF errCode = 0 THEN
		-- Не было ошибок при выполнении кода выше

		-- Сформировать строку для записи
		IF isSuccess THEN
			SET _string = "NETRUN_SUCCESS ";
		ELSE
			SET _string = "NETRUN_FAIL ";
		END IF;
		SET _string = CONCAT(_string, action);

		-- Добавить запись
		INSERT INTO logs
		(object_id, subject_id, log_action, value)
		VALUES
		(objectId, netrunnerId, _string, _netrunnerLvl);

	END IF;

	-- Откат или завершение процедуры
	IF errCode = 0 THEN
		COMMIT;
	ELSE
		ROLLBACK;
	END if;

END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `setLockAccess` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `setLockAccess`(
    IN 	lock_id 		INT UNSIGNED,			-- id замка
	IN 	card_id			BIGINT UNSIGNED,		-- id карты пользователя
	IN	grantAccess		BOOL,					-- TRUE: назначить, FALSE: отозвать
	OUT errCode			INT						-- Код ошибки, 0 успешно, таблица ниже
)
BEGIN

    /*
    Назначает или отзывает пользователю с card_id доступ к замку с lock_id
    */

	/* 
	ERR CODE:
	При любом ERR CODE кроме 0 права доступа не изменяются. Внимательно следи за цифрами кодов, они не подряд!

	0 	- NO_ERROR					(нет ошибок, успешное выполнение)
	1 	- USER_NOT_FOUND 			(пользователя с таким card_id не найдено в базе)
	2	- LOCK_NOT_FOUND			(замка с таким lock_id не найдено в базе)
	5 	- ACCESS_ALREADY_GRANTED  	(этот пользователь итак имеет доступ к этому замку)
	6 	- ACCESS_ALREADY_REVOKED  	(этот пользователь итак не имеет доступа к этому замку)
	*/

	-- Код +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	-- Начальные значения
	SET errCode = 0;

	-- Проверка допустимости grantAccess
	IF grantAccess IS NULL OR grantAccess NOT IN (0, 1) THEN
		SIGNAL SQLSTATE '45000'
			SET MESSAGE_TEXT = 'grantAccess должен быть TRUE (1) или FALSE (0)';

	-- Проверка существования пользователя
	ELSEIF NOT EXISTS (
		SELECT 1
		FROM main
		WHERE main.card_id = card_id
	) THEN
		SET errCode = 1;

	-- Проверка существования замка
	ELSEIF NOT EXISTS (
		SELECT 1
		FROM locks
		WHERE locks.lock_id = lock_id
	) THEN
		SET errCode = 2;

	-- Назначение доступа
	ELSEIF grantAccess = TRUE THEN
		BEGIN
			-- Повторная пара (lock_id, card_id) запрещена PRIMARY KEY
			-- Преобразовать ошибку дубликата MySQL в код ошибки процедуры "доступ уже назначен"
			DECLARE CONTINUE HANDLER FOR 1062
				SET errCode = 5;

			INSERT INTO lock_access (lock_id, card_id)
			VALUES (lock_id, card_id);
		END;

	-- Отзыв доступа
	ELSE
		DELETE FROM lock_access
		WHERE lock_access.lock_id = lock_id
			AND lock_access.card_id = card_id;

		-- Если ничего не удалено, доступ уже отсутствовал - вернуть код ошибки процедуры
		IF ROW_COUNT() = 0 THEN
			SET errCode = 6;
		END IF;
		
	END IF;

END ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `transferBalanceCommon` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `transferBalanceCommon`(
    in  senderId		int unsigned,			-- id отправителя
    in  receiverId		int unsigned,			-- id получателя
    in  amount			int unsigned,			-- Количество (положительное!)
    in  sourceLosa		bool,					-- Если TRUE переводится losa, иначе money
    in  isNetrun		bool,					-- TRUE если перевод через модель нетрана (в логи будет записано NETRUN_SEND / NETRUN_RECEIVE)
    out errCode			int						-- Код ошибки, 0 успешно, таблица ниже
)
begin

    /*
    Общая процедура перевода баланса по id
    */

	/* 
	ERR CODE:
	При любом ERR CODE кроме 0 перевод не был произведен!
	
	0 	- NO_ERROR				(нет ошибок, успешное выполнение)
	1 	- SENDER_NOT_FOUND 		(пользователь не найден в БД, для перевода - отправитель не найден в БД)
	2 	- RECEIVER_NOT_FOUND 	(получатель не найден в БД)
	3 	- ZERO_DENY 			(недостаточно средств при переводе)
	4	- RECEIVER_OVERFLOW		(перевод приведет к переполнению INT получателя)
	255 - OTHER					(другая ошибка)
	*/
	
	-- Объявления +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	declare _senderBalance int;				-- Баланс отправителя
	declare _receiverBalance int;			-- Баланс получателя
	declare _notFound bool default false;	-- Флаг "отправитель/получатель не найден"
	declare _logActionSend varchar(50);		-- Строка для записи в логи об отправке
	declare _logActionReceive varchar(50);	-- Строка для записи в логи о получении
	
    -- Любая SQL-ошибка = откат транзакции и вернуть ошибку тому кто вызвал процедуру
    declare exit HANDLER for sqlexception
    begin
        rollback;							-- Откатить все изменения если они были сделаны
        resignal;							-- Отправить код ошибки SQL вызывающему процедуру
    end;
    
    -- Если SELECT ... INTO не нашел строку (получатель / отправитель не найден в БД)
	declare continue HANDLER for not found
	begin
	    SET _notFound = TRUE;
	end;

	-- Код +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	set errCode = 0;

    start transaction;

    -- Запрет перевода самому себе ?
    
    -- Запрет перевода amount=0 ?

    -- Прочитать баланс отправителя в _senderBalance и заблокировать строку для изменений  -------------------------------------------------------
    set _notFound = false;		-- Инициализация флага "не найден"
    if sourceLosa then
    	-- Читать losa
	    select losa
		into _senderBalance
		from main
		where id = senderId
		for update;
    else
    	-- Читать money
    	select money
		into _senderBalance
		from main
		where id = senderId
		for update;
    end if;
    
    -- Убедится что отправитель существует (HANDLER for not found срабатывал)  ------------------------------------------------------------------
    if _notFound then
    	-- При попытке чтения баланса отправителя записи с таким id не найдено в базе
        set errCode = 1;     	-- SENDER_NOT_FOUND
    end if;
    
    -- Прочитать баланс получателя в _receiverBalance и заблокировать строку для изменений -------------------------------------------------------
	set _notFound = false;		-- Инициализация флага "не найден"
    if errCode = 0 then
    	-- Не было ошибок при выполнении кода выше
		if sourceLosa then
			-- Читать losa
			select losa
			into _receiverBalance
			from main
			where id = receiverId
			for update;
		else
			-- Читать money
			select money
			into _receiverBalance
			from main
			where id = receiverId
			for update;
		end if;
    end if;
    
    -- Убедится что получатель существует  ------------------------------------------------------------------------------------------------------
    if errCode = 0 then
    	-- Не было ошибок при выполнении кода выше
	    if _notFound then
	    	-- При попытке чтения баланса получателя записи с таким id не найдено в базе
	        set errCode = 2; 	-- RECEIVER_NOT_FOUND
	    end if;
    end if;

    -- Проверка что баланс отправителя не станет ниже нуля  -------------------------------------------------------------------------------------
    if errCode = 0 then
    	-- Не было ошибок при выполнении кода выше
        if _senderBalance < CAST(amount AS SIGNED) then
        	-- Недостаточно средств
            set errCode = 3; 	-- ZERO_DENY
        end if;
    end if;

	-- Проверка что баланс получателя не переполнится  ------------------------------------------------------------------------------------------
    if errCode = 0 then
    	-- Не было ошибок при выполнении кода выше
        if _receiverBalance > 2147483647 - CAST(amount AS SIGNED) then
        	-- Переполнение баланса
            set errCode = 4; 	-- RECEIVER_OVERFLOW
        end if;
    end if;
	
   	-- Перевод баланса --------------------------------------------------------------------------------------------------------------------------
    if errCode = 0 then
    	-- Не было ошибок при выполнении кода выше
    	if sourceLosa then
    		-- Перевод losa
			-- Списание у отправителя
	        update main
	        set losa = losa - CAST(amount AS SIGNED)
	        where id = senderId;
			-- Начисление получателю
	        update main
	        set losa = losa + CAST(amount AS SIGNED)
	        where id = receiverId;
    	else
    		-- Перевод money
    		-- Списание у отправителя
	        update main
	        set money = money - CAST(amount AS SIGNED)
	        where id = senderId;
			-- Начисление получателю
	        update main
	        set money = money + CAST(amount AS SIGNED)
	        where id = receiverId;
    	end if;
    end if;
    
   	-- Добавить записи в логи --------------------------------------------------------------------------------------------------
    if errCode = 0 then
    	-- Не было ошибок при выполнении кода выше

		-- Формирование строк для записи
		if sourceLosa then
			if isNetrun then
				set _logActionSend = "NETRUN_SEND LOSA";
				set _logActionReceive = "NETRUN_RECEIVE LOSA";
			else
				set _logActionSend = "SEND LOSA";
				set _logActionReceive = "RECEIVE LOSA";
			end if;
		else
			if isNetrun then
				set _logActionSend = "NETRUN_SEND MONEY";
				set _logActionReceive = "NETRUN_RECEIVE MONEY";
			else
				set _logActionSend = "SEND MONEY";
				set _logActionReceive = "RECEIVE MONEY";
			end if;
		end if;

		-- Запись отправки
    	insert into logs
		(object_id, subject_id, log_action, value)
		values
		(senderId, receiverId, _logActionSend, amount);
		-- Запись получения
    	insert into logs
		(object_id, subject_id, log_action, value)
		values
		(receiverId, senderId, _logActionReceive, amount);

    end if;
    
    -- Финальное решение о применении изменений или откате в случае ошибок -----------------------------------------------------
  	if errCode = 0 then
		-- Применить изменения
		commit;
	else
    	-- Исключительная ситуация - откатить изменения
		rollback;
	end if;

end ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!50003 DROP PROCEDURE IF EXISTS `transferBalanceTerminal` */;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_unicode_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'IGNORE_SPACE,ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `transferBalanceTerminal`(
    IN 	senderCardId 	bigint unsigned,		-- cardId отправителя
    IN 	receiverCardId 	bigint unsigned,		-- cardId получателя
    IN 	amount 			int unsigned,			-- Количество (положительное!)
    IN 	sourceLosa 		bool					-- Если TRUE переводится losa, иначе money
)
begin

    /*
    Процедура перевода баланса через терминалы по card_id
	Получает id по card_id и вызывает transferBalanceCommon
	isNetrun всегда false
	Возвращает _errCode не как out а select as code
    */

	/* ERR CODE:
	При любом ERR CODE кроме 0 перевод не был произведен!
	0 	- NO_ERROR				(нет ошибок, успешное выполнение)
	1 	- SENDER_NOT_FOUND 		(пользователь не найден в БД, для перевода - отправитель не найден в БД)
	2 	- RECEIVER_NOT_FOUND 	(получатель не найден в БД)
	3 	- ZERO_DENY 			(недостаточно средств при переводе)
	4	- RECEIVER_OVERFLOW		(перевод приведет к переполнению INT получателя)
	255 - OTHER					(другая ошибка)
	*/
	
	-- Объявления +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	declare _senderId int unsigned;							-- Баланс отправителя
	declare _receiverId int unsigned;						-- Баланс получателя
	declare _notFound bool default false;					-- Флаг "отправитель/получатель не найден"
	declare _errCode int default 0;							-- Код ошибки, возвращаемый этой процедурой
	
    -- Если SELECT ... INTO не нашел строку (получатель / отправитель не найден в БД)
	declare continue HANDLER for not found
	begin
	    SET _notFound = TRUE;
	end;

	-- Код +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

    -- Найти id отправителя по его card_id  ------------------------------------------------------------------------------------------------------
    set _notFound = false;		-- Инициализация флага "не найден"
	select id
	into _senderId
	from main
	where card_id = senderCardId;
    
    -- Убедится что отправитель существует (HANDLER for not found срабатывал)  ------------------------------------------------------------------
    if _notFound then
    	-- При попытке чтения баланса отправителя записи с таким card_id не найдено в базе
        set _errCode = 1;     	-- SENDER_NOT_FOUND
    end if;
    
    -- Найти id получателя по его card_id  ------------------------------------------------------------------------------------------------------
	set _notFound = false;		-- Инициализация флага "не найден"
    if _errCode = 0 then
    	-- Не было ошибок при выполнении кода выше
		select id
		into _receiverId
		from main
		where card_id = receiverCardId;
    end if;
    
    -- Убедится что получатель существует  ------------------------------------------------------------------------------------------------------
    if _errCode = 0 then
    	-- Не было ошибок при выполнении кода выше
	    if _notFound then
	    	-- При попытке чтения id получателя записи с таким card_id не найдено в базе
	        set _errCode = 2; 	-- RECEIVER_NOT_FOUND
	    end if;
    end if;

    -- Вызвать transferBalanceCommon -------------------------------------------------------------------------------------------------------------
    if _errCode = 0 then
    	-- Не было ошибок при выполнении кода выше
	    call transferBalanceCommon(_senderId, _receiverId, amount, sourceLosa, false, _errCode);
    end if;

	-- Вернуть код ошибки
	select _errCode as code;

end ;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-09-28 12:26:07
